export const LEARNING_MATERIAL = `
01 情報とメディアの特性
本時の目標: 情報について理解し、新しい情報社会について理解する。情報とメディアにおける特性について理解する。
1 情報とは
・（ 情報 ）世の中の出来事や知識を伝えるための「知らせ」で、ある物事や事情の報告であり、受け手にとって意味や価値を持つ。意思決定の判断基準となる。
・（ データ ）観測や調査などで得られる客観的事実
・データ → 情報 →（ 知 識 ）情報をとりいれるもと（情報源 ）よりデータを得る → 情報として分析→情報を分析して問題解決に役立つように体系化する。
※情報の種類と検証
（ 一 次 情 報 ） 自分の目で見るなど、直接体験して得た情報
（ 二 次 情 報 ） ほかの人から聞いたりほかの人が選別したりした情報
※三次情報：情報元がだれかわからない情報
・（ クロスチェック ・ 相 互 確 認 ）得られた情報を、ほかの情報をつきあわせること。
・（ 情 報 の 検 証 ）クロスチェックなどにより、誤った情報や偽の情報を取り除くこと。
・（ ビ ッ グ デ ー タ ）人や物、社会や自然から大量のデータを収集して蓄積・解析して問題解決に活用されている。
2 新しい情報社会の到来
狩猟社会→農耕社会→工業社会（産業革命）→情報社会→
・→新しい情報社会（Society5.0 ）サイバー空間とフィジカル空間の融合
3 情報とメディアの特性
・（ メ デ ィ ア ）：情報を伝達する仲介役（表現形式）。メディアという言葉はいくつかの意味で使われる
（ 表現メディア ） 情報の表現手段として使われる
（ 伝達メディア ） 情報の伝達や通信の仲立ちとして使われる
（ 記録メディア ） 情報の記録や蓄積に使われる
情報技術の進展→メディアも進化→新しいメディアも次々と生まれている。
・（ メ デ ィ ア リ テ ラ シー ）メディアを介して得られた情報を的確に読み解き、利用する力
・情報の特性
情報の（ 残存性 ） 一度つくられた情報は，完全に消えることがない。＝情報が消えずに残る性質
情報の（ 複製性 ） 情報は，比較的簡単に複製(コピー)することができる。
情報の（ 伝播性 ） 情報は，伝わりやすく，広まりやすい。
・情報の（ 個別性 ）：情報を受け取る人によって価値や評価が異なる。
・情報の（ 目的性 ）：発信をする目的や意図が込められている。受信する目的に基づいて情報を受け取り解釈する。
・表現形式（メディア）の変換：情報には、その内容をどう扱うかによって、適した表現形式がある。表現形式を変換すると、（ 失われる ）情報と、（付け加わる ）情報があることに注意する。

02 問題解決
本時の目標: 問題解決とは何かを理解する。問題の発見や解決のための手順について理解する。
1 問題解決の流れ
・（ 問 題 ）：あるべき姿（理想）と現実とのギャップ。
・（ 問 題 解 決 ）：現実を理想に近づけ、両者のギャップ（問題）を埋める行為。
・（ PDCA サイクル ）：Plan（計画）→Do（実行）→Check（評価）→Act（改善）の４段階を繰り返し、業務などを改善していく手法。
①問題の（ 発 見 ）：問題（現実と理想のギャップ）を把握する。
②問題の（ 定義・明確化 ）：情報を収集し、分析することで問題を明確化する。目的と目標を設定する。
③解決方法の提案：得られた情報を評価、分析し、その結果から解決方法を考え、実行の計画を立てる。
2 発想法
①問題の発見や③解決方法の提案のために、発想を生み出す方法には以下のようなものがある。
・（ブレーンストーミング ）集団で多くのアイディアを出すための手法。４つのルールを守り、アイディアを集める。①質より量を重視する ②批判をしない ③自由に発言する ④他人の意見に便乗する
・（ KJ 法 ）アイディアをカードにまとめグループ化し、タイトルをつけてまとめる手法
・（マインドマップ ）：発想を広げつつ整理していく方法
3 解決案の実行と評価
④ 解決案の（ 実 行 ）情報技術を活用し、計画を実行する。解決方法によって、効率や結果が変わる場合がある。
※関連用語
・（ガントチャート ）作業計画を視覚的に表現するために用いられる工程表
・（トレードオフ ）１つの要素を改善すると、ほかの要素が悪化するような状態
⑤ 評価・振り返り：自分で振り返ったり（自己評価）、他者に評価（相互評価・外部評価）してもらったりして改善する。外部評価ではアンケートなどを活用し、次の問題解決に役立てる。

03 情報モラル
本時の目標: 不特定多数を対象としたコミュニケーションにおけるモラルとマナーについて理解する。情報化が個人に及ぼす影響について理解する。
1 不特定多数を対象としたコミュニケーション
・（ 情 報 社 会 ）：情報が重要な役割をはたすようになった社会
※ 技術や法律による安全対策がなされている。
・情報の（ モラル ）：情報社会で適正な活動を行うためのもとになる考え方と態度（目に見えない）
・情報の（ マナー ）：情報を取り扱う際の好ましい行動や作法（目に見える）
・（ フィルタリング ）：特定の条件によるアクセスするサイトを制限する機能
2 情報化が個人に及ぼす影響
・（ ＶＤＴ障害 ）：画面を長時間見続けることで発症する疲れ目や身体の不調
・（ テクノ不安症 ）：コンピュータを仕事で活用することに適応できないことで起きる精神的な症状
・（ テクノ依存症 ）：過度に情報機器に依存してしまう精神的な症状
・（ 情報格差【 デジタルデバイド 】）：情報技術を使える人と使えない人との有利・不利の知識的、経済的、社会的な格差のこと。
・スマートフォン依存症（ネット依存 ）スマートフォンなどを毎日，長時間利用するあまりに日常生活に支障をきたしてしまう。症状が高じると，成績の低下，授業中の居眠り，遅刻，友人とのトラブルなどの問題が生じやすくなる。

04 個人情報
本時の目標: 個人情報およびプライバシーの概念や，個人情報の取り扱いについて学ぶ。
1 個人情報
・（ 個人情報 ）それを見れば（生存する）個人が特定できてしまう情報。ほかの情報を組み合わせたりするなどで個人を特定、識別できる情報
・基本四情報：（ 氏名 、住所 、生年月日 、性別 ）
ほかの個人情報：電話番号、学歴、職業など
（ 個人識別符号 ）指紋，顔認識のデータ，パスポート・運転免許証の番号，マイナンバーなど
（ 要配慮個人情報 ）人種，信条，社会的身分，病歴，犯罪の経歴
2 プライバシーの保護
・（ プライバシー【 権 】 ）私的な情報（食べ物や音楽の好み，本や薬の購入履歴，現在地の情報など）について他人から干渉や侵害を受けたりしない個人の私生活上の自由のこと、またその権利
・（ 肖像権 ）本人の許可なしに肖像（自分の顔や姿）を撮影されたり，利用されたりしない権利
・（ パブリシティ権 ）名前や写真などが経済的な価値をもつ芸能人やスポーツ選手などの有名人が、他人にそれらを使用されることを制限できる権利
3 個人情報の提供と流出
※個人情報の流出を防ぐためには以下のような技術に注意が必要である。
・（フィッシング詐欺 ）本物に似せた偽の Web サイトに誘導してユーザ ID やパスワードを入力させて不正に取得する
・（キーロガー ）キーボードを使ってコンピュータに入力する文字を記録するソフトウェアやハードウェア
・（スパイウェア ）利用者の情報を収集し，その情報を情報収集者へ自動的に送信するソフトウェア
※個人情報の保護
・（個人情報保護法 ）個人情報を取り扱う事業者に対して、守るべき義務などを定めた法律
・情報セキュリティポリシーの策定
・（プライバシーマーク ）個人情報に対して適切な保護措置を行っている会社などの事業者に与えられるマーク
・（オプトアウト ）方式：利用者がサービスの中止を事業者に伝えるまではサービスの提供を続ける方式
・（オプトイン ）方式：利用者がサービスを利用する意思を事業者に伝えるまではサービスを提供しない方式
・（ ジオタグ ）：写真に含まれる位置情報

05 知的財産権
①産業財産権
本時の目標: 情報社会において守るべき法規や，我々がもっている権利について理解する。
1 知的財産権
・知的財産権には（ 保護 ）と（ 活用 ）という２つの側面がある。
・（ 知的財産権 ）音楽、文章、演劇、コンピュータのプログラム、製品のつくり方、製品のデザインやアイディアなど、知的なはたらきで創造した財産を（ 知的財産 ）といい、その価値を守る権利
・（ 産業財産権 ）おもに産業や工業製品の製造などに関係する権利。特許庁に届け出て認められるとその権利が発生する。＝（ 方式 ）主義
2 産業財産権
( 特許 )権: ものまたは方法の技術面のアイデアのうち高度なもの。実用新案と比べてライフサイクルが長いもの。保護期間: 出願から(20 )年
( 実用新案 )権: 物品の形状，構造などの技術面のアイデアで早期実施できるもの。ライフサイクルが短いもの。保護期間: 出願から(10 )年
( 意匠 )権: 物品（物品の部分を含む）の形状，模様，色彩など，ものの外観としてのデザイン。保護期間: 出願から(25 )年
( 商標 )権: 商品やサービスについて自他の識別力を有する文字，図形，記号，立体的形状，色彩，音，ならびにそれらの組み合わせ（時間とともに変化するロゴなども含む）。保護期間: 登録から(10 )年（更新あり）
②著作権
本時の目標: 他人の著作物を適切に利用したり，自分の著作物を公開したりする方法について学ぶ
3 著作者の権利
・（ 著作権 ）芸術や学術などの創作活動に関するもので、著作物（文章、写真、絵画、音楽、映画、演劇、美術、プログラムなど）に関する権利
・（ 著作者 ）著作物を創作した人。プロ，アマチュア，大人，子どもにかかわらない。
・（ 共同著作物 ）共同で創作し，各人の寄与が分離できないもの。創作に寄与した全員が著作者となる。
・(著作者人格 )権: 著作者の人格的な利益を保護する権利。公表権，氏名表示権，同一性保持権を含む。譲渡したり相続したりすることはできない。
・(著作 )権（財産権）: 財産的な利益を保護する権利。一部または全部を他人に譲渡あるいは相続することができる。財産権をもつ人を( 著作権者 )という。保護期間は，原則として，創作時から著作者の死後（70 ）年を経過するまで
著作権は創作した時点で権利が発生する…（ 無方式主義 ）。特別に登録する必要はない
4 伝達者の権利
・（ 著作隣接権 ）歌手・演奏家・俳優などの実演家，CD などの制作者，放送事業者など，著作物などを公衆に伝達する人や事業者がもっている権利。人格権と財産権がある。
5 権利の侵害例
・（ 著作権法 ）著作者や伝達者の権利を保護する法律
6 著作権の例外規定
・許諾を得なくてよい場合: 〇保護対象となる著作物でない場合(憲法や裁判の判例など) 〇保護期間が切れている場合 〇著作権の権利制限規定による例外の場合
一定の例外的な場合に著作権などを制限して，著作権者などに許諾を得ることなく利用できる。
例）・（ 引用 ）※自説を証明したり，説明したりするために，他人の文章などを自分の文中に取り入れること。
・私的使用のためのコピー
・教育機関や公共図書館，福祉目的でのコピーなど
※著作権（財産権）が制限される場合でも，著作者人格権は制限されない。
7 情報の利用と公開
・（ クリエイティブ・コモンズ ）著作物についてライセンスを表示することを提案している組織
BY: 表示 (Attribution)
NC: 非営利 (NonCommercial)
ND: 改変禁止 (No Derivative Works)
SA: 継承 (Share Alike)

06 情報セキュリティ
本時の目標: 情報セキュリティの基本的な内容について理解する。サイバー犯罪に関連する知識を学ぶ。
・（ 情報セキュリティ ）情報の機密性，完全性，可用性を確保し、安全で円滑な活用を維持すること。
・（ 機密性 ）：許可された人だけが、情報にアクセスできる状態にする
・（ 完全性 ）：情報が正確で安全な状態を保つ(破壊，改竄または消去されていない状態）
・（ 可用性 ）：許可された人が必要な時に，情報にアクセスできる状態にする
1 ユーザ ID とパスワードの管理（機密性）
・（ 認証 ）：当人が正規の利用者であると認識すること
・（ ユーザ ID ）：正規の利用者であることを識別するためのもの
・（ パスワード）：本人であることを確認するためのもの。
2 サイバー犯罪
・（ サイバー犯罪 ）：ネットワークやコンピュータを悪用した犯罪
・（ クラッキング ）：不正アクセスによってデータを盗み出したり、破壊・改ざん・消去したりする行為
・（ Dos 攻撃 ）：サーバに大量の接続要求を送り付け、正当な接続を妨害する
〇（ マルウェア ）：悪意を持ったソフトウェア
・（ ランサムウェア ）ファイルを勝手に暗号化し、解除をするための身代金（ランサム）を要求するマルウェア
・（ アドウェア ）ユーザの意図しない広告を表示するマルウェア
・（ スパイウェア ）：情報を勝手に送信してしまうマルウェア
・（ キーロガー ）：キーボードからの入力を監視して記録するソフトウェア
〇情報の不正入手
・（ ソーシャルエンジニアリング ）コンピュータの技術を用いず、情報を不正入手する行為
・（ フィッシング詐欺 ）：偽の Web サイトに誘導し、情報を不正入手する行為
・（ ワンクリック詐欺 ）：契約をしていないのに、購入したとして費用を請求する。
・（ スキミング ）：クレジットカードなどの情報を盗み、不正に複製する行為
3 サイバー犯罪への対策
・（ 情報セキュリティポリシー ）：方針や基準、具体的な手順をまとめたもの
・（ ウイルス対策ソフトウェア ）ウイルスに感染しているかどうか検査し，感染していたらウイルスを取り除くソフトウェア。
※ウイルス対策: ウイルスの特徴を収録した（ 定義ファイル ）を，最新のものへ常に更新しておく。OS やアプリは常に最新版に更新し、（ セキュリティパッチ ）が公開されたら，すぐに適用する。
・不正アクセス：利用権限がない者が、システムやデータにアクセスすること。
・（ 不正アクセス禁止法 ）：不正アクセスを禁止する法律
・（ アクセス制御 ）：ネットワーク上のデータに対し，誰がどんな権限でアクセスできるか制御すること。管理者は，利用者に応じた適切な（ アクセス権 ）を付与する。
・（ ファイアウォール ）外部からの不正アクセスを防ぐため、ネットワークの出入り口に設けられる仕組みの総称。
・（ フィルタリング ）インターネットなどを通じて出入りする情報を監視し，内容に問題があれば接続を拒否し，通信を遮断する技術
・ブラックリスト方式：アクセスしてはいけない Web サイトやカテゴリを指定する
・ホワイトリスト方式：アクセスしてよいものを指定する
・（ VLAN ）：物理的な接続に依存せず，仮想的にグループを作り，それぞれ分離された LAN を構築する技術

07 情報技術の発展
本時の目標: 身近な情報システムや電子決済について学ぶ。現在，社会で注目されている情報技術と、新しい社会での課題解決について学ぶ。
1 身近な情報システム
・（ 情報システム ）ネットワークを使って、情報を集めたり、伝えたり、サービスを提供したりする仕組み
身近な情報システムの例
・（ ＰＯＳシステム ）：店舗内で商品を販売した時点での情報を管理し活用するシステム
・（ 電子商取引 ）：商品を Web サイトで売買できる仕組み
・（ 予約システム ）：電車や飛行機，コンサートの座席を予約するシステム
・（ 気象観測システム ）：各地の観測地点から測定したデータを分析して気象情報を提供
・銀行の（ ＡＴＭ ）：現金の支払い・預金・通帳記入や振込などができる専用端末機
・全地球測位システム：（ GPS ）（Global Positioning System）。人工衛星からの電波を利用して，位置を測定するシステム
・高度道路交通システム：道路交通における利便性や安全性，物流の効率などを高めるシステム。有料道路での自動料金支払いができる（ ETC ）（Electronic Toll Collection System）など。
2 電子マネーの普及
・（ 電子決済 ）【キャッシュレス決済】現金を用いることなく電子的なデータの送受を行い、処理する決済方式のこと
・（ 電子マネー ）：カードタイプとスマホタイプがある。
・（ ＱＲコード決済 ）【バーコード決済】専用のＱＲコードを活用して決済を行う方法。決済専用アプリをインストールして行う。電子決済には，事前に現金をチャージするプリペイド型と，後で支払うポストペイ型がある。
・（ クラウドコンピューティング ）インターネットを経由して，サーバやソフトウェアなどを利用できるサービス形態
3 注目される情報技術
・（ 人工知能 ）【AI 】人間が行っている知的活動の一部を、コンピュータに代替させることを目的とする技術
・（ IoT ）：（モノ ）のインターネット。あらゆるモノ（物体）がインターネットに接続され，相互に通信を行う環境。モノから収集される多種多様で大量のデータ（（ ビッグデータ ））を人工知能で分析することによって得られた情報が，社会で有効に活用されている。
・（ 仮想現実 ）【VR 】：現実とは別の空間を構築し体験できる技術
・（ 拡張現実 ）【AR 】：現実空間に情報を重ね合わせる技術
・複合現実【MR】：現実と仮想空間が融合し、相互に影響を与える技術
4 新しい社会での課題解決
これまでの情報社会：人が行う情報収集や活用には限界がある。人がコンピュータや（ インターネット ）を使って情報を収集・蓄積し，処理して活用
新しい情報社会: IoT により，実世界（フィジカル空間）のデータがビッグデータとして（ サイバー ）空間で集約。それを人工知能（AI）が解析し，実世界の課題解決や，新たな価値を創造する。

08 メディアとコミュニケーション
本時の目標: メディアとコミュニケーションの形態、正しいメディアリテラシーについて学ぶ。
1 メディアの機能
・（通信【 コミュニケーション 】）：情報をやりとりすること
・（ メディア ）：情報をやり取りする（ 方法 ）や（ 媒体 ）
【・情報を表現する手段 ・情報を送受信する仕組み ・情報を伝達する物体】
・不特定多数向けのメディア（ マスメディア ）
2 メディアの発達
・口頭（オーラル）：（ 言葉 ）が生まれたことによる情報の表現方法
・筆記：（ 文字 ）の発明による情報の表現方法
・新聞、（ 書籍 ）【印刷物】：15 世紀の（ 活版印刷 ）の発明による情報表現方法
・電信、（ 電話 ）：19 世紀以降の電気通信技術の発達により生まれた情報の表現方法
・ラジオ放送、（ テレビ ）放送：20 世紀以降の放送技術の発達により生まれた情報の表現方法。一方向の情報伝達だが，広い範囲の不特定多数に情報を伝達できる。
・電子メール、Web ページ：20 世紀の後半の（ インターネット ）技術の発達により生まれた情報の表現方法。地理的な制約を越えて，双方向の情報伝達が可能。
※（ ソーシャルメディア ）：多数の人々が相互に情報発信するコミュニケーションサービス
3 コミュニケーションの形態
・同期型コミュニケーション：コミュニケーションのタイミングが同じであること（会話、電話、ビデオ通話）
・非同期型コミュニケーション：タイミングが異なる（LINE、メール、手紙、SNS、ホームページ、YouTube）
1対1: 会話、電話、ビデオ通話、LINE、メール、手紙
1対多: 授業、プレゼン、ライブ配信、SNS、ホームページ、YouTube
特徴: 同期型は反応がわかるが時間場所に制約がある。非同期型は便利で蓄積しやすいが、勘違いや消せないリスクがある。
4 メディアリテラシー
・インターネット上に存在する情報は，（ 信憑 ）性が保証されているとはいえない。
そのまま信用せず，（ 客観 ）的にとらえ，ほかの情報と（ 比較 ）して，正しい情報かどうかを常に確かめなければならない。
＝（ メディアリテラシー ）
・メディアからの情報を主体的に読み解く能力、メディアにアクセスして活用する能力
・メディアを通じてコミュニケーションを行う能力 など

09 情報デザイン
本時の目標: 情報デザインの意味と具体例を理解し、望ましい表現方法を学ぶ。
1 情報デザインとは
・（ 情報デザイン ）：情報をわかりやすく伝えたり、操作性を高めたりするための工夫や表現方法、技術
〇表現方法の工夫
・情報の（ 抽象化 ）：余分な情報を除いて要点をシンプルに表現すること（アイコン、ピクトグラム）
・情報の（ 構造化 ）：情報を整理、まとめ、強調などして、わかりやすく表現すること（順序、階層、分岐、包含）
・情報の（ 可視化 ）：情報を視覚的にわかりやすく表現すること（図、表、グラフなど）
2 ユニバーサルデザイン
・（ユニバーサルデザイン ）：年齢や性別、言語、身体能力に関係なく皆が使いやすいデザイン
使えない（アクセシビリティ）使える（使いにくい）（ユーザビリティ）使いやすい
①（情報バリアフリー ）障がい者や高齢者の障壁を取り除く➡文字の（ 拡大 ）・（ 読み上げ ）機能
②（ 色覚バリアフリー ）色覚の多様性を考慮する➡見分けやすい（ 配色 ）、（ 色以外 ）の情報
③（ユーザインタフェース ）コンピュータの操作環境や情報の表示形式➡CUI、（ GUI ）【マウス・アイコン】
④（ユニバーサルデザインフォント ）使いやすく読み間違えにくいフォント➡例）明朝、ゴシック、UD 教科書体
※アフォーダンス：ものと人の動作の関係性、知覚的・視覚的な手がかり ※できることがわかる
シグニファイア：アフォーダンスを支える付加的な情報 ※なにをするかがわかる
3 ピクトグラム
（ ピクトグラム ）は、（ 言語 ）に頼らず直感的に情報を伝えることができる。
・文字を一切使わないで伝えたい情報を表現する。
・人を表現するときは、目・鼻・口などは描かず、簡略化して表現する。
・使用していい色は２色まで。その色が持っている意味を考えて配色する。

10 アナログとデジタル
①２進数
本時の目標: アナログとデジタルのちがいや情報のデジタル化によるメリットについて学ぶ。２進数を用いたコンピュータ内で情報を表現する方法と，情報量について学ぶ。
・（ アナログ ）：連続した量（連続量）で表現すること。
・（ デジタル ）：とびとびの量（離散量）で表現すること。
1 デジタル情報の特徴
・情報が（失われにくい ） ・コピー（複製）しても劣化しない
・編集が簡単・総合的に扱える
・（ 圧縮 ）：データの意味を保ったままデータ量を小さくする処理のこと
2 ２進法による表現
・（ ビット ）：２進数の１桁に相当し、０と１の２つの状態しかもたない（ 情報量 ）の最小単位。８ビットをまとめて１（ バイト ）という
■表 情報量の単位
bit (ビット)
B (バイト) = 8 bit
KB (キロバイト) = 1024 B
MB (メガバイト) = 1024 KB
GB (ギガバイト) = 1024 MB
TB (テラバイト) = 1024 GB
PB (ペタバイト) = 1024 TB
EB (エクサバイト) = 1024 PB
②16 進数
本時の目標: ２進数と 16 進数の変換について学ぶ。
〇要点：表現できる情報量
●１ビットで表現できる情報量は，２の1乗＝（ ２ ）通り
●１バイト（８ビット）で表現できる情報量は，２の8乗＝（ 256 ）通り
●ｎビットで表現できる情報量は，（ ２のn乗 ）通り
1 数値のデジタル化
・10 進数の数値も，0 と 1 の組み合わせで表現することができる。
・２進数で数値を表現すると桁数が多くなるので，（ 16 ）進数で表現する方法がよく使われる
→16 種類の文字が必要であるため，０～９だけでなく，Ａ～Ｆの英字を使用する
10進: 0..9, 10(A), 11(B), 12(C), 13(D), 14(E), 15(F)
`;